# Задача 1
# Напиши программу, которая открывает файл "hello.txt" в режиме записи ("w")
# и записывает в него строку "Привет, мир!".
# Используй контекстный менеджер with.

with open("hello.txt", "w") as file:
    file.write("Привет, мир!")

# Задача 2
# Напиши программу, которая открывает файл "hello.txt" в режиме чтения ("r")
# и выводит его содержимое на экран.
# Используй контекстный менеджер with.

with open("hello.txt", "r") as file:
    print(file.read())

# Задача 3
# Напиши программу, которая открывает файл "notes.txt" в режиме записи ("w")
# и записывает в него три строки:
# "Первая строка"
# "Вторая строка"
# "Третья строка"
# Каждая строка должна быть записана с новой строки.
# Используй контекстный менеджер with.

with open("notes.txt","w") as file:
    file.write("Первая строка")
    file.write("\nВторая строка")
    file.write("\nТретья строка")

# Задача 4
# Напиши программу, которая открывает файл "notes.txt" в режиме чтения ("r")
# и построчно выводит его содержимое на экран.
# Используй цикл for и контекстный менеджер with

with open("notes.txt","r") as file:
    for line in file:
        print(line.strip())

# Задача 5
# Напиши программу, которая открывает файл "log.txt" в режиме добавления ("a")
# и дописывает в конец файла строку "Новая запись".
# Используй контекстный менеджер with.

with open("log.txt","a") as file:
    file.write("\nНовая запись")

# Задача 6
# Напиши программу, которая:
# 1. Открывает файл "data.txt" в режиме записи ("w")
# 2. Записывает в него строку "Python"
# 3. В ТОМ ЖЕ блоке with читает содержимое файла обратно и выводит его на экран.
#
# Подсказка: подумай, сработает ли это, если открыть файл в режиме "w".
# Если нет — какой режим нужен, чтобы можно было и записать, и прочитать?

with open("data.txt","w+") as file:
    file.write("Python")
    file.seek(0)
    print(file.read())